/**
 * @name DevelopmentNotation
 * @autor mg
 */

function DevelopmentNotation() {


var self = this;

/*  "Во всех формах все компоненты следует именовать"
	Имена элементов управления должны начинаться с префикса, обозначающего тип элемента.
		lbl	Надпись
		pnl	Панель
		ed      Поле ввода
		grd	Сетка данных
		tabs    Набор вкладок
		tab	Вкладка
		btn	Кнопка
		radio   Переключатель
		chk	Флажок
		img	Картинка
		pie	Диаграмма
		scheme  Схема
		page    Закладки
		mnu     Меню
		popup   Контекстное меню
                tlb     Панель инструментов
	Наборы данных и параметры в модели данных должны иметь осмысленные имена, начинающиеся с "ds".
"Всем таблицам и полям в них следует давать осмысленные физические имена"

"Соглашения о терминах"
	Периодическая таблица - таблица, хранящая изменяющиеся во времени данные.
	Действие - изменение одной единицы данных предметной области.
	Операция - упорядоченная последовательность действий.
	Журнал - таблица учета операций (документов, расчетов) и форма её просмотра.
	Документ - операция над данными, производящаяся собственной формой, и оставляющая запись о себе в журнале документов.
	Расчет - упорядоченная последовательность операций, оставляющая запись о результате каждого действия в журнале расчетов.
														
"Требования к текстам программ"
	Запрещено использовать литеральные константы - ссылки на справочники. Разрешается использовать константы - ссылки на формы, отчеты и т.п.

"Шаблоны форм и отчетов"
	Новые формы рекомендуется делать на основе шаблонов.
	
"Соглашение о периодических данных"
	Для соблюдения непрерывности временной оси, одна из точек инервала изменения периодического атрибута (Дн;Дк) должна быть
	выколотой. Это позволяет избежать "нахлеста" смежных интевалов. В качестве выколотой точки принимаем конец интевала (Дк):
	[Дн;Дк). Это значит, что для выборки актуальных данных следует строить условия вида: (TA>=Дн and TA<Дк), где TA - точка актуальности.

"Соглашение о формах выбора"
        Для позиционирования в форме выбора на ранее выбранном значении должен использоваться метод setSelected().
*/     
        
}